#+TITLE: See Grades
#+LANGUAGE: en
#+OPTIONS: H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t
#+STARTUP: showeverything

You may edit this file locally, but the grading branch on Github will contain
your official scores.

* Final Grade
:FINAL_GRADE:
#+BEGIN_EXAMPLE
Repo: mue14003
Grade: A
Score: 139.00
As of: Mon, 16 Apr 2018
#+END_EXAMPLE
:END:

* Gradebook
Here are the grades for all your assignments.
#+tblname: grades-as-table
| Grade Item       | Raw Score | Timeliness | Weight | Weighted Score |
|------------------+-----------+------------+--------+----------------|
| [[file:week00/00-ponder--prove.org][00 Ponder--Prove]] |    235.00 |       1.00 |   2.50 |          5.875 |
| [[file:week01/01-prepare-teach.org][01 Prepare-Teach]] |     89.00 |       1.00 |   2.50 |          2.225 |
| [[file:week01/01-ponder--prove.org][01 Ponder--Prove]] |    107.00 |       1.00 |   2.50 |          2.675 |
| [[file:week02/02-prepare-teach.org][02 Prepare-Teach]] |     95.00 |       1.00 |   2.50 |          2.375 |
| [[file:week02/02-ponder--prove.org][02 Ponder--Prove]] |    436.00 |       1.00 |   3.00 |          13.08 |
| [[file:week03/03-prepare-teach.org][03 Prepare-Teach]] |    100.00 |       1.00 |   2.50 |            2.5 |
| [[file:week03/03-ponder--prove.org][03 Ponder--Prove]] |    231.00 |       1.00 |   3.50 |          8.085 |
| [[file:week04/04-prepare-teach.org][04 Prepare-Teach]] |    100.00 |       1.00 |   2.50 |            2.5 |
| [[file:week04/04-ponder--prove.org][04 Ponder--Prove]] |    366.00 |       1.00 |   4.00 |          14.64 |
| [[file:week05/05-prepare-teach.org][05 Prepare-Teach]] |    100.00 |       1.00 |   2.50 |            2.5 |
| [[file:week05/05-ponder--prove.org][05 Ponder--Prove]] |    331.00 |       1.00 |   4.50 |         14.895 |
| [[file:week06/06-prepare-teach.org][06 Prepare-Teach]] |    100.00 |       1.10 |   2.50 |           2.75 |
| [[file:week06/06-ponder--prove.org][06 Ponder--Prove]] |    239.00 |       1.00 |   5.00 |          11.95 |
| [[file:week07/07-prepare-teach.org][07 Prepare-Teach]] |    100.00 |       1.00 |   2.50 |            2.5 |
| [[file:week07/07-ponder--prove.org][07 Ponder--Prove]] |    222.50 |       1.00 |   5.50 |        12.2375 |
| [[file:week08/08-prepare-teach.org][08 Prepare-Teach]] |    100.00 |       1.10 |   2.50 |           2.75 |
| [[file:week08/08-ponder--prove.org][08 Ponder--Prove]] |    150.00 |       1.07 |   6.00 |           9.63 |
| [[file:week09/09-prepare-teach.org][09 Prepare-Teach]] |    100.00 |       1.00 |   2.50 |            2.5 |
| [[file:week09/09-ponder--prove.org][09 Ponder--Prove]] |     78.00 |       1.00 |   7.00 |           5.46 |
| [[file:week10/10-prepare-teach.org][10 Prepare-Teach]] |    100.00 |       1.00 |   2.50 |            2.5 |
| [[file:week10/10-ponder--prove.org][10 Ponder--Prove]] |     97.00 |       1.00 |   8.00 |           7.76 |
| [[file:week11/11-prepare-teach.org][11 Prepare-Teach]] |    100.00 |       1.00 |   2.50 |            2.5 |
| [[file:week11/11-ponder--prove.org][11 Ponder--Prove]] |    192.00 |       1.00 |   8.50 |          16.32 |
| [[file:week12/12-prepare-teach.org][12 Prepare-Teach]] |    100.00 |       1.10 |   2.50 |           2.75 |
| [[file:week12/12-ponder--prove.org][12 Ponder--Prove]] |    306.00 |       1.00 |  10.00 |           30.6 |
#+tblfm: $5=$2*$3*$4/100

* What If Calculator
  If you want to use this file as a what if calculator, follow these steps:

  1. Edit the values you want to in the preceding table.
  2. Put your cursor on the "#+tblfm:" line, then type ", ,".
  3. Put your cursor somewhere in the code block below, then type ", ,".
  4. Your "what if" grade will be displayed at the bottom of the file.

#+NAME: compute-final-grade
#+BEGIN_SRC emacs-lisp :var grades=grades-as-table
  (let* ((weighted-percentage (apply '+ (mapcar 'fifth grades)))
         (number (ceiling weighted-percentage))
         (tensDigit (/ number 10))
         (onesDigit (mod number 10))
         (index (min (max (- tensDigit 5) 0) 4))
         (letter (substring "FDCBA" index (+ index 1)))
         (sign (if (<= onesDigit 2) "-" (if (>= onesDigit 7) "+")))
         (letter-grade (concat letter (if (and (< number 95) (>= number 60)) sign))))
    (list (format "%2.2f" weighted-percentage) letter-grade))
#+END_SRC

#+RESULTS: compute-final-grade
| 183.56 | A |
